# WorksetPreview Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetPreview Class
Members See Also
---
Represents an accessor for workset data which can be obtained from an unopened document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class WorksetPreview : IDisposable
```

Visual Basic
---
```text
Public Class WorksetPreview _
	Implements IDisposable
```

Visual C++
---
```text
public ref class WorksetPreview : IDisposable
```

# Remarks
As a base class of Workset, this class has limited access to data. WorksetPreviews are obtained from WorksharingUtils.GetUserWorksetInfo() from an unopened document.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..WorksetPreview Autodesk.Revit.DB..::..Workset
# See Also
WorksetPreview Members
Autodesk.Revit.DB Namespace